tap "1password/tap"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
tap "martido/graph"
brew "xz"
brew "alembic"
brew "cryptography"
brew "python@3.13"
brew "ansible-lint"
brew "python@3.12"
brew "ansible@9"
brew "python@3.11"
brew "autojump"
brew "bash"
brew "bat"
brew "black"
brew "btop"
brew "chezmoi"
brew "coreutils"
brew "cpufetch"
brew "docker-completion"
brew "docker-compose"
brew "exiftool"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "grep"
brew "grex"
brew "guile"
brew "helm"
brew "htop"
brew "iperf3"
brew "kubernetes-cli"
brew "kustomize"
brew "mackup"
brew "mas"
brew "media-info"
brew "midnight-commander"
brew "minikube"
brew "n"
brew "ncdu"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "nnn"
brew "node"
brew "openjdk"
brew "openshift-cli"
brew "p7zip"
brew "pandoc"
brew "pg_top"
brew "podman"
brew "pspg"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "ranger"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "spaceship"
brew "speedtest-cli"
brew "sql-lint"
brew "ssh-copy-id"
brew "tailscale"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "a-better-finder-rename"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "arq"
cask "audiobook-builder"
cask "bartender"
cask "bettertouchtool"
cask "betterzip"
cask "carbon-copy-cloner"
cask "choosy"
cask "cryptomator"
cask "daisydisk"
cask "dbeaver-community"
cask "dd-utility"
cask "devonthink"
cask "docker"
cask "easyfind"
cask "firefox"
cask "fluor"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
cask "font-meslo-lg-nerd-font"
cask "garmin-express"
cask "gemini"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "hyperkey"
cask "icollections"
cask "iina"
cask "imazing"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "mac-mouse-fix"
cask "macfuse"
cask "macupdater"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "obsidian"
cask "onlyoffice"
cask "pdf-expert"
cask "powerphotos"
cask "qlvideo"
cask "rectangle"
cask "spacelauncher"
cask "spotify"
cask "steam"
cask "syncthing"
cask "syntax-highlight"
cask "teamviewer"
cask "transmission-remote-gui"
cask "transmit"
cask "typora"
cask "ulbow"
cask "utm"
cask "vagrant"
cask "vagrant-vmware-utility"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Accelerate", id: 1459809092
mas "Affinity Photo", id: 824183456
mas "Amphetamine", id: 937984704
mas "Copy Link in Markdown", id: 1571033540
mas "Daglig bakgrundsbild - för Bing", id: 920897043
mas "Diagrams", id: 1276248849
mas "Exporter", id: 1099120373
mas "FineReader OCR Pro", id: 687301476
mas "Flow", id: 1423210932
mas "GoodTask", id: 1143437985
mas "Guru Maps", id: 321745474
mas "Hash", id: 945689735
mas "Instapaper", id: 288545208
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Mercury", id: 1621800675
mas "Messenger", id: 1480068668
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pins", id: 1547106997
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "rubiTrack 6", id: 1557892760
mas "Slack", id: 803453959
mas "Super Agent", id: 1568262835
mas "Tailscale", id: 1475387142
mas "TextSniper", id: 1528890965
mas "Things", id: 904280696
mas "URL Linker", id: 1289119450
mas "Userscripts-Mac-App", id: 1463298887
mas "Vinegar", id: 1591303229
mas "Voice Dream Reader", id: 972112040
vscode "1password.op-vscode"
vscode "adpyke.vscode-sql-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.bookmarks"
vscode "almenon.arepl"
vscode "charliermarsh.ruff"
vscode "dan-c-underwood.arm"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "huangbaoshan.comment-aligner"
vscode "janisdd.vscode-edit-csv"
vscode "johnpapa.vscode-peacock"
vscode "kortina.vscode-markdown-notes"
vscode "liviuschera.noctis"
vscode "lorenzopirro.rust-flash-snippets"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "mvllow.rose-pine"
vscode "nyxiative.rust-and-friends"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "shaharkazaz.git-merger"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-swedish"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
